Tekla Open API Reference for Tekla Structures 2025
PhaseCollection.CopyTo Method
 Copies the elements of the ICollection to an Array, starting at a particular Array index.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void CopyTo(
	Array Array,
	int Index
)
Public Sub CopyTo (
	Array As Array,
	Index As Integer
)
Parameters
Array
Type: System.Array
 The one-dimensional Array that is the destination of the elements copied from the ICollection. The Array must have zero-based indexing.
Index
Type: System.Int32
The zero-based index in the array at which copying begins.
Implements
ICollection.CopyTo(Array, Int32)
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the array is null.
ArgumentOutOfRangeException | Thrown when the index is less than zero.
ArgumentException |  Thrown when the array is multidimensional, or the index is equal to or greater than the length of the array, or the number of elements in the source ICollection is greater than the available space from the index to the end of the destination array.
InvalidCastException |  Thrown when the type of the source ICollection cannot be cast automatically to the type of the destination array.
See Also
Reference
PhaseCollection Class
Tekla.Structures.Model Namespace